var Mock = require('mockjs')
Mock.mock('https://jsonplaceholder.typicode.com/posts/', function() {
    return "success";
})
Mock.mock("https://getInstitute",function(){
	var institute=JSON.stringify(		
		{
			"金融与投资学院":[
							"金融学专业",
							"金融工程专业",
							"财政学专业",
							],
			"会计学院":[
						"会计学专业",
						"投资学专业",
						"财务管理专业",
						],
			"保险学院":[
						"保险学专业",
						"精算学专业",
						],
			"经济贸易学院":[
						"国际经济与贸易专业",
						"经济学专业",
						"经济与金融专业",
						"国际商务"
						],
			"信用管理学院":[
						"信用管理专业",
						"资产评估专业",
						],
			"工商管理学院":[
						"工商管理专业",
						"市场营销专业",
						"物流管理专业",
						"酒店管理专业",
						"人力资源管理专业"
						],
			"互联网金融与信息工程学院":[
						"互联网金融专业",
						"信息管理与信息系统专业",
						"计算机科学与技术专业",
						"电子商务专业",
						"软件工程专业"
						],
			"外国语言与文化学院":[
						"商务英语专业",
						"英语专业",
						"翻译专业",
						],
			"法学院":[
						"法学专业"
					],
			"财经与新媒体学院":[
						"汉语言文学专业",
						"网络与新媒体专业",
						"文化产业管理专业"
						],
			"金融数学与统计学院":[
						"金融数学专业",
						"数学与应用数学专业",
						"信息与计算科学专业",
						"应用统计学专业",
						"经济统计学专业"
						],
			"公共管理学院":[
						"行政管理专业",
						"公共事业管理专业",
						"应用心理学专业",
						"劳动与社会保障专业",
						"劳动关系专业",
						"社会工作专业"
						]
		}		
	);
	return institute;

})
// 输出结果
// console.log(JSON.stringify(data, null, 4))